Revit 2027 API
SolidGlass.SolidglassBumpMap Property
 The property labeled "Image" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassBumpMap { get; }
Public Shared ReadOnly Property SolidglassBumpMap As String
	Get
public:
static property String^ SolidglassBumpMap {
	String^ get ();
}
static member SolidglassBumpMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace